using System;
using Unit4.TurtleLib;

namespace TurtleLoops
{
    class Program
    {
        static void Main(string[] args)
        {
            Turtle t = new Turtle();
            t.SetDelay(500);
            t.MoveForward(0);
            //--התחלת הריקוד--

            //חמש צעדים קדימה
            t.MoveForward(5);
            //שלוש צעדים אחורה
            t.MoveBackward(3);

            //סיבוב ימינה בתשעים מעלות
            t.TurnRight(90);

            //עשר צעדים קדימה
            t.MoveForward(10);

            //סיבוב שמאלה 180 מעלות
            t.TurnLeft(180);
            
            //המשיכו אתם מכאן על פי ההוראות
            //שבע צעדים אחורה

            //שלוש צעדים קדימה

            //סיבוב ימינה 45 מעלות

            //חמש פעמים המהלך הבא: שלוש צעדים קדימה, 2 צעדים אחורה, סיבוב ימינה 30 מעלות

            //שבע פעמים המהלך הבא: 5 צעדים אחורה, 5 צעדים קדימה
            
            //ארבע פעמים המהלך הבא: סיבוב שמאלה 60 מעלות, 4 צעדים קדימה, 4 צעדים אחרוה, 2 צעדים קדימה, 2 צעדים אחורה

            //סיבוב ימינה 180 מעלות

            //חמש עשרה צעדים אחורה

            //שש פעמים המהלך הבא: 3 צעדים קדימה, סיבוב שמאלה 15 מעלות

            //שבע עשרה צעדים קדימה

            //--סוף הריקוד--
        }
    }
}
